p_pipeFlowAnalysis/pimpleFoamPipe/LES/Smagorinsky/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }

    pFinal
    {
        $p;
		tolerance	1e-06;
        relTol          0;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
	
	"(U|k|epsilon|omega|R|nuTilda)Final"
    {
		solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

    Phi
    {
		solver		GAMG;
		smoother	DIC;

		tolerance	1e-06;
		relTol		0.01;
    }
}

PIMPLE
{
    nOuterCorrectors	2;
    nCorrectors    	 3;
    nNonOrthogonalCorrectors 2;
	
	residualControl
	{
		U
		{
			tolerance	1e-3;
			relTol		0;
		}
		p
		{
			tolerance	5e-2;
			relTol		0;
		}
	}
}

relaxationFactors
{
	fields
	{
		p		0.3;
		pFinal	1;
	}
	equations
	{
		"U|k|epsilon|omega|R|nuTilda"			0.3;
		"(U|k|epsilon|omega|R|nuTilda)Final"	1;
	}
}

potentialFlow
{
    nNonOrthogonalCorrectors 3;
}
// ************************************************************************* //
